// МЕТОДЫ ========================================================================================================


// ВИД 1 ====================== НИЧЕГО НЕ ВОЗВРАЩАЕТ И НИЧЕГО НЕ ПРИНИМАЕТ
// void Method1()
// {
//     Console.WriteLine("Author ...");
// }
// Как вызвать?
// Method1();

//ВИД 2 ======================== НИЧЕГО НЕ ВОЗВРАЩАЮТ НО МОГУТ ПРИНИМАТЬ АРГУМЕНТЫ

// void Method2(string msg)
// {
//     Console.WriteLine(msg);
// }

// Method2("Message");
//================================================================================================================

// void Method567(string msg, int count)
// {
//     int i = 0;
//     while (i < count)
//     {
//         Console.WriteLine(msg);
//         i++;
//     }
// }
// Method567(msg: "Text", count: 4);

//ВИД 3 ===================================== ЧТО-ТО ВОЗВРАЩАЮТ НО НИЧЕГО НЕ ПРИНИМАЮТ

int 